9/data/attachments/b2fdc68525c1ca8d.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Edward_friend_Friend_15915_2</nif:username>
            <nif:friendToBeRequested>soap_friends_fab22856-611d-4f4b-9475-f7710b7ccd0a</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>